const answer = `특징: 노드는 V8 자바스크립트 엔진으로 빌드된 자바스크립트 런타임입니다. 노드는 자바스크립트 프로그램을 컴퓨터에서 실행할 수 있습니다. 
노드는 자바스크립트 실행기라고 봐도 무방하므로, 우리가 자바스크립트를 모른다면 노드를 전혀 활용할 수 없습니다. 
이전에는 웹 브라우저에서만 실행되었던 자바스크립트를 서버 측에서도 실행할 수 있도록 해줍니다. 
노드를 사용하는 가장 큰 이유 중 하나는 비동기식 이벤트 기반 아키텍처로 인한 높은 처리량입니다. 
이 아키텍처는 많은 I/O 작업을 처리하는 데 효과적이며, 이로 인해 노드는 높은 확장성과 성능을 제공합니다.
2.노드의 아키텍처에서 가장 중요한 부분 중 하나가 이벤트를 받아 처리하는 기능이다.
3.모듈과 패키지: 메인이 되는 자바스크립트 파일을 두고, 일부 기능만 담당하는 코드를 별도의 파일로 만들 수 있습니다.
좋은점: 1. 노드를 이용한다면 빠른 개발이 가능하다(Javascript 기반이고 개발 구조가 단순화 되어 있어서 빠르게 개발이 가능하다. 또한 클라이언트에서 자바스크립트로 front-end를 개발하던 FE 개발자들도 손쉽게 서버 프로그래밍이 가능하다.)
2. 매우 빠르고 확장성이 뛰어납니다. 노드가 많은 수의 클라이언트 요청을 동시에 처리할 수 있게 만듭니다. 또한, 노드는 단일 스레드 모델을 사용하기 때문에 서버에 대한 부하가 분산되지 않으므로 성능이 유지됩니다.
`;
console.log(answer);